---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Analysis.EnergyAnalysisZone
source: html/69a1d638-bb8d-240e-0af7-91d6bf1243bd.htm
---
# EnergyAnalysisZone Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.